cardGameBackEnd/app/models/game.rb

INSERT INTO "games" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 10], ["created_at", "2020-09-29 18:26:37.184071"], ["updated_at", "2020-09-29 18:26:37.184071"]]
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "game_matches" ("game_id", "match_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["game_id", 1], ["match_id", 37], ["created_at", "2020-09-29 18:26:37.249415"], ["updated_at", "2020-09-29 18:26:37.249415"]]
SELECT "games".* FROM "games" ORDER BY "games"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "matches".* FROM "matches"
SELECT "game_matches".* FROM "game_matches"
DELETE FROM "game_matches" WHERE "game_matches"."id" = ?  [["id", 33]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 5]]
---
    def self.create_game
        new_game = Game.create(user_id: User.last.id)

        9.times do
            GameMatch.create(
                game_id: Game.last.id,
                match_id: Match.all.sample.id
            )
        end
        game_matches = GameMatch.all.slice(-9,9).map(&:match).uniq
        if game_matches.length != 9
            GameMatch.all.slice(-9,9).each do |match|
                match.destroy
            end
            new_game.destroy
            self.create_game
        end
        return GameMatch.all.slice(-9,9)