cardGameBackEnd/app/controllers/games_controller.rb

    def new
        new_game = Game.create_game
---
INSERT INTO "games" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 10], ["created_at", "2020-09-29 18:26:37.184071"], ["updated_at", "2020-09-29 18:26:37.184071"]]

    def update
        game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]